<template>
  <view>
    <div class="protocol">
      <h1 style="text-align: center">服务协议</h1>
      <p>尊敬的用户，欢迎您注册成为本网站用户。在注册前请您仔细阅读如下服务条款：</p><br>
      <p>本服务协议双方为本网站与本网站用户，本服务协议具有合同效力。您确认本服务协议后，
        本服务协议即在您和本网站之间产生法律效力。请您务必在注册之前认真阅读全部服务协议内容，
        如有任何疑问，可向本网站咨询。无论您事实上是否在注册之前认真阅读了本服务协议，
        只要您点击协议正本下方的“注册”按钮并按照本网站注册程序成功注册为用户，您的行为仍然表示您同意并签署了本服务协议。<br>
      <h2>一、本网站服务条款的确认和接纳</h2>
      <p>本网站各项服务的所有权和运作权归本网站拥有。</p>
      <h2>二、用户必须</h2>
      <p>〔一〕自行配备上网的所需设备，包括个人电脑、调制解调器或其他必备上网装置；</p>
      <p>〔二〕自行负担个人上网所支付的与此服务有关的电话费用、网络费用。</p>
      <h2>三、用户在本网站上交易平台上不得发布下列违法信息</h2>
      <p>      〔一〕对宪法所确定的基本原则的；危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>      〔二〕损害国家荣誉和利益的；煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>      〔三〕破坏国家宗教政策，宣扬邪教和封建迷信的；〔四〕散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>      〔五〕散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
      <p>      〔六〕侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>      〔七〕含有法律、行政法规禁止的其他内容的。</p>
      <h2>四、有关个人资料用户同意</h2>
      <p>      〔一〕提供及时、详尽及准确的个人资料；</p>
      <p>      〔二〕同意接收来自本网站的信息；</p>
      <p>      〔三〕不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料；</p>
      <p>      〔四〕本网站不公开用户的姓名、地址、电子邮箱和笔名，以下情况除外：</p>
      <p>      1、用户授权本网站透露这些信息；</p>
      <p>      2，相应的法律及程序要求本网站提供用户的个人资料。如果用户提供的资料包含有不正确的信息，本网站保留结束用户使用本网站信息服务资格的权利。</p>
      <h2>五、用户在注册时应当选择稳定性及安全性相对较好的电子邮箱，且同意接受并阅读本网站发往用户的各类电子邮件。</h2>
      <p>如用户未及时从自己的电子邮箱接受电子邮件或因用户电子邮箱或用户电子邮件接收及阅读程序本身的问题使电子邮件无法正常接收或阅读的，只要本网站成功发送了电子邮件，应当视为用户已经接收到相关的电子邮件。电子邮件在发信服务器上所记录的发出时间视为送达时间。</p>
      <h2>      六、用户须知</h2>
      <p>      〔一〕用户在注册时应当选择常用的手机号码，且同意接受并阅读本网站发往用户的各类短信。如用户未及时从自己的手机接受短信或因用户手机或用户短信接收及阅读程序本身的问题使短信无法正常接收或阅读的，只要本网站成功发送了手机短信，应当视为用户已经接收到相关的短信；</p>
      <p>      〔二〕用户在注册时应当填写正确、有效的手机号码，此手机号码用以找回密码。如因用户未填写正确、有效的手机号码而导致密码无法找回，无法正确登陆本网站造成用户本人损失的，本网站不承担相关责任。</p>
      <h2>      七、服务条款的修改</h2>
      <p>本网站有权在必要时修改服务条款，本网站服务条款一旦发生变动，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以主动取消获得的本网站信息服务。如果用户继续享用本网站信息服务，则视为接受服务条款的变动。本网站保留随时修改或中断服务而不需通知用户的权利。本网站行使修改或中断服务的权利，不需对用户或第三方负责。</p>
      <h2>      八、用户隐私制度</h2>
      <p>尊重用户个人隐私是本网站的一项基本政策。所以，本网站一定不会在未经合法用户授权时公开、编辑或透露其注册资料及保存在本网站中的非公开内容，除非有法律许可要求或本网站在诚信的基础上认为透露这些信息在以下四种情况是必要的：</p>
      <p>      〔一〕遵守有关法律规定，遵从本网站合法服务程序；</p>
      <p>      〔二〕保持维护本网站的商标所有权；</p>
      <p>      〔三〕在紧急情况下竭力维护用户个人和社会大众的隐私安全；</p>
      <p>      〔四〕协议其他相关的要求；</p>
      <p>      〔五〕本网站保留发布会员人口分析资询的权利。</p>
      <h2>      九、用户的账号、密码和安全性</h2>
      <p>你一旦注册成功成为用户，你将得到一个密码和账号。如果你不保管好自己的账号和密码安全，将负全部责任。另外，每个用户都要对其账户中的所有活动和事件负全责。你可随时根据指示改变你的密码，也可以结束旧的账户重开一个新账户。用户同意若发现任何非法使用用户账户或安全漏洞的情况，请立即通告本网站。</p>
      <h2>      十、拒绝提供担保</h2>
      <p>用户明确同意信息服务的使用由用户个人承担风险。本网站不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保。</p>
    </div>
  </view>
</template>

<script>
export default {
  name: 'protocol'
}
</script>

<style scoped>
.protocol {
  margin: 50rpx;
}
.protocol p {
  font-size: 32rpx;
}
.protocol h2 {
  margin-top: 32rpx;
}
.protocol h1 {
  margin-bottom: 32rpx;
}
</style>
